In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [5]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Working with Dates

In [6]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### 1. Extract year

In [8]:
date['date_year'] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  date_year
870 2019-08-10        3800       16       2       2019
176 2018-12-16        1475       16       8       2018
568 2019-12-01        4505       25       1       2019
47  2018-12-11        3437       14       2       2018
624 2018-11-09        1737        1       8       2018

### 2. Extract Month

In [9]:
date['date_month_no'] = date['date'].dt.month

date.head()

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10
3 2019-08-17        7292       25       1       2019              8
4 2019-01-06        4344       25       3       2019              1

In [10]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

### 3. Extract Days

In [11]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_dow
0,2019-12-10,5628,25,3,2019,12,December,1
1,2018-08-15,3646,14,157,2018,8,August,2
2,2018-10-23,1859,25,1,2018,10,October,1
3,2019-08-17,7292,25,1,2019,8,August,5
4,2019-01-06,4344,25,3,2019,1,January,6

In [12]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

        date  date_year  date_month_no date_month_name  date_dow date_dow_name
0 2019-12-10       2019             12        December         1       Tuesday
1 2018-08-15       2018              8          August         2     Wednesday
2 2018-10-23       2018             10         October         1       Tuesday
3 2019-08-17       2019              8          August         5      Saturday
4 2019-01-06       2019              1         January         6        Sunday

In [13]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,1,Tuesday,0
1,2018-08-15,2018,8,August,2,Wednesday,0
2,2018-10-23,2018,10,October,1,Tuesday,0
3,2019-08-17,2019,8,August,5,Saturday,1
4,2019-01-06,2019,1,January,6,Sunday,1

### Extract week of the year

In [15]:
date['date_week'] = date['date'].dt.isocalendar().week.astype(int)
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,1,Tuesday,0,50
1,2018-08-15,2018,8,August,2,Wednesday,0,33
2,2018-10-23,2018,10,October,1,Tuesday,0,43
3,2019-08-17,2019,8,August,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,Sunday,1,1

### Extract Quarter

In [16]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,Sunday,1,1,1

### Extract Semester

In [17]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,Sunday,1,1,1,1

### Extract Time elapsed between dates

In [18]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 12, 31, 8, 59, 30, 417583)

In [19]:
today - date['date']

0     2213 days 08:59:30.417583
1     2695 days 08:59:30.417583
2     2626 days 08:59:30.417583
3     2328 days 08:59:30.417583
4     2551 days 08:59:30.417583
                 ...
995   2641 days 08:59:30.417583
996   2582 days 08:59:30.417583
997   2430 days 08:59:30.417583
998   2495 days 08:59:30.417583
999   2269 days 08:59:30.417583
Name: date, Length: 1000, dtype: timedelta64[ns]

In [20]:
(today - date['date']).dt.days

0      2213
1      2695
2      2626
3      2328
4      2551
       ...
995    2641
996    2582
997    2430
998    2495
999    2269
Name: date, Length: 1000, dtype: int64

In [22]:
months_passed = np.round(
    (today - date['date']) / np.timedelta64(30, 'D'), 0
)

In [24]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [25]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [26]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [27]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

### Extract Time part

In [28]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

### Time difference

In [29]:
today - time['date']

0     4398 days 23:10:00
1     4263 days 00:20:00
2     4748 days 23:39:00
3     4050 days 23:29:00
4     4448 days 00:49:00
             ...
995   5037 days 23:10:00
996   4359 days 00:46:00
997   4824 days 00:23:00
998   4940 days 00:26:00
999   4212 days 00:35:00
Name: date, Length: 1000, dtype: timedelta64[ns]

In [30]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      380070600.0
1      368324400.0
2      410312340.0
3      350004540.0
4      384310140.0
          ...
995    435280200.0
996    376620360.0
997    416794980.0
998    426817560.0
999    363918900.0
Name: date, Length: 1000, dtype: float64

In [31]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6334510.0
1      6138740.0
2      6838539.0
3      5833409.0
4      6405169.0
         ...
995    7254670.0
996    6277006.0
997    6946583.0
998    7113626.0
999    6065315.0
Name: date, Length: 1000, dtype: float64

In [32]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      105575.166667
1      102312.333333
2      113975.650000
3       97223.483333
4      106752.816667
           ...
995    120911.166667
996    104616.766667
997    115776.383333
998    118560.433333
999    101088.583333
Name: date, Length: 1000, dtype: float64